app/Controllers/Kecamatan.php

public function tampil(){
$kecamatan = new KecamatanModel();
// mengambil semua data di tabel kecamatan
$data['query'] = $kecamatan->findAll();
---
SELECT *
FROM `kecamatan`

public function tambah(){
$kabupaten = new KabupatenModel();
$kabupaten = $kabupaten->findAll();
---
SELECT *
FROM `kabupaten`

public function simpan(){
$kecamatan = new KecamatanModel();
// mengambil data dari masing-masing input pada form tambah
// dan disimpan pada array untuk disimpan ke tabel kecamatan
$data_kecamatan = [
'kode_kecamatan'=>$this->request->getVar('kode_kecamatan'),
'id_kabupaten'=>$this->request->getVar('id_kabupaten'),
'nama_kecamatan'=>$this->request->getVar('nama_kecamatan'),
'jumlah_penduduk'=>$this->request->getVar('jumlah_penduduk'),
'luas_wilayah'=>$this->request->getVar('luas_wilayah')
];
// menggunakan query builder insert
// untuk menyimpan ke tabel kecamatan
$kecamatan->insert($data_kecamatan);
---
INSERT INTO `kecamatan` (`kode_kecamatan`, `id_kabupaten`, `nama_kecamatan`, `jumlah_penduduk`, `luas_wilayah`) VALUES ('3302740', '1', 'PURWOKERTO UTARA', '50573', '901')